In [1]:
%load_ext sql
from time import time
import configparser
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
config = configparser.ConfigParser()
config.read('dwh.cfg')

HOST = config.get('CLUSTER', 'HOST')
DB_NAME = config.get('CLUSTER', 'DB_NAME')
DB_USER = config.get('CLUSTER', 'DB_USER')
DB_PASSWORD = config.get('CLUSTER', 'DB_PASSWORD')
DB_PORT = config.get('CLUSTER', 'DB_PORT')

conn_string="postgresql://{}:{}@{}:{}/{}".format(DB_USER, DB_PASSWORD, HOST, DB_PORT, DB_NAME)
print(conn_string)
%sql $conn_string

postgresql://awsuser:dallas41C+@redshift-cluster.cj2p55sjbzar.us-west-2.redshift.amazonaws.com:5439/dev

'Connected: awsuser@dev'

In [3]:
%run -i create_tables.py
%run -i etl.py

I am inside of function main
I am inside of function drop tables
I am outside of function drop tables
I am inside of function create tables
I am outside of function create tables
I am outside of function main
----------------------------------------------
-                                            -
-                                            -
----------------------------------------------

    INSERT INTO songplays (
    start_time,
    user_id,
    level,
    song_id,
    artist_id,
    sessionId,
    location,
    user_agent
    )
    SELECT DISTINCT (e.ts)          AS   start_time,
          e.userId                  AS   user_id,
          e.level                   AS   level,
          s.song_id                 AS   song_id,
          s.artist_id               AS   artist_id,
          e.sessionId               AS   sessionId,
          e.location                AS   location,
          e.userAgent               AS   user_agent
    FROM staging_events e
    JOIN staging_songs  s   ON (e.song=s.title  AND e.artist=s.artist_name)
    AND e.page='NextSong'

----------------------------------------------
-                                            -
-                                            -
----------------------------------------------

    INSERT INTO users (
    user_id,
    first_name,
    last_name,
    gender,
    level
    )
    SELECT DISTINCT (userId)        AS   user_id,
          fistName                  AS   first_name,
          lastName                  AS   last_name,
          gender,
          level
    FROM staging_events
    WHERE user_id IS NOT NULL AND page='NextSong'

----------------------------------------------
-                                            -
-                                            -
----------------------------------------------

    INSERT INTO songs (
    song_id,
    title,
    artist_id,
    year,
    duration
    )
    SELECT DISTINCT (song_id)       AS   song_id,
          title,
          artist_id,
          year,
          duration
    FROM staging_songs
    WHERE song_id IS NOT NULL

----------------------------------------------
-                                            -
-                                            -
----------------------------------------------

    INSERT INTO artists (
    artist_id,
    name,
    location,
    latitude,
    longitude
    )
    SELECT DISTINCT (artist_id)     AS   artist_id,
          artist_name               AS   name,
          artist_location           AS   location,
          artist_latitude           AS   latitude,
          artist_longitude          AS   longitude
    FROM staging_songs
    WHERE artist_id IS NOT NULL

----------------------------------------------
-                                            -
-                                            -
----------------------------------------------

    INSERT INTO time (
    start_time,
    hour,
    day,
    week,
    month,
    year,
    weekday
    )
    SELECT DISTINCT (start_time),
          EXTRACT ( hour     FROM  start_time )     AS   hour,
          EXTRACT ( day      FROM  start_time )     AS   day,
          EXTRACT ( week     FROM  start_time )     AS   week,
          EXTRACT ( month    FROM  start_time )     AS   month,
          EXTRACT ( year     FROM  start_time )     AS   year,
          EXTRACT (dayofweek FROM  start_time )     AS   weekday
    FROM songplays

In [4]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://awsuser:***@redshift-cluster.cj2p55sjbzar.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(5, datetime.datetime(2018, 11, 14, 15, 24, 12, 796000), 80, 'paid', 'SOARUPP12AB01842E0', 'ARD46C811C8A414F3F', '574', 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (21, datetime.datetime(2018, 11, 29, 20, 21, 41, 796000), 49, 'paid', 'SOABIXP12A8C135F75', 'AR15DJQ1187FB5910C', '1041', 'San Francisco-Oakland-Hayward, CA', 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (37, datetime.datetime(2018, 11, 29, 17, 1, 34, 796000), 49, 'paid', 'SORDWGC12AB01840A3', 'ARMB0B11187B9AE46C', '1041', 'San Francisco-Oakland-Hayward, CA', 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (53, datetime.datetime(2018, 11, 4, 9, 41, 55, 796000), 44, 'paid', 'SOAFQGA12A8C1367FA', 'AR0IVTL1187B9AD520', '196', 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (69, datetime.datetime(2018, 11, 15, 19, 22, 32, 796000), 44, 'paid', 'SOAKYDR12A6D4F7800', 'AREACYD1187FB566DE', '619', 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0')]

In [5]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://awsuser:***@redshift-cluster.cj2p55sjbzar.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(3, 'Isaac', 'Valdez', 'M', 'free'),
 (4, 'Alivia', 'Terrell', 'F', 'free'),
 (9, 'Wyatt', 'Scott', 'M', 'free'),
 (11, 'Christian', 'Porter', 'F', 'free'),
 (13, 'Ava', 'Robinson', 'F', 'free')]

In [6]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://awsuser:***@redshift-cluster.cj2p55sjbzar.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('SOAAEHR12A6D4FB060', 'Slaves & Bulldozers', 'AR5N8VN1187FB37A4E', 1991, 415.81669),
 ('SOAAETA12A6D4FC626', 'Shine', 'ARQXK0B1187B9ACC97', 2007, 448.23465),
 ('SOAAFHQ12A6D4F836E', "Ridin' Rims (Explicit Album Version)", 'AR3CQ2D1187B9B1953', 2006, 322.84689),
 ('SOAAXYX12A8C133B77', 'Can I Get With You', 'AR4OH581187B9B7157', 2000, 242.72934),
 ('SOABCEU12A8C132027', 'Cold Waste', 'ARL6NP61187B98C1FC', 2007, 385.43628)]

In [7]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://awsuser:***@redshift-cluster.cj2p55sjbzar.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('AR00YYQ1187FB504DC', 'God Is My Co-Pilot', 'New York, NY', Decimal('40.714550000'), Decimal('-74.007120000')),
 ('AR01G6G1187B9892EF', 'Tonino Carotone', '', None, None),
 ('AR01SCU1187B9A693C', 'Street Dogs', 'Boston, MA', None, None),
 ('AR01WHF1187B9B53B8', 'Lullatone', 'Nagoya, Japan', None, None),
 ('AR03BDP1187FB5B324', 'Britney Spears feat. Pharrell Williams', 'Kentwood, LA; Los Angeles, CA', Decimal('34.053489999'), Decimal('-118.245320000'))]

In [8]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://awsuser:***@redshift-cluster.cj2p55sjbzar.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(datetime.datetime(2018, 11, 2, 16, 35, 0, 796000), 16, 2, 44, 11, 2018, '5'),
 (datetime.datetime(2018, 11, 4, 6, 51, 12, 796000), 6, 4, 44, 11, 2018, '0'),
 (datetime.datetime(2018, 11, 4, 9, 19, 3, 796000), 9, 4, 44, 11, 2018, '0'),
 (datetime.datetime(2018, 11, 5, 1, 58, 24, 796000), 1, 5, 45, 11, 2018, '1'),
 (datetime.datetime(2018, 11, 5, 2, 30, 17, 796000), 2, 5, 45, 11, 2018, '1')]